-- 1.部門(dept)表に、以下のデータを作成する。
NULL;

-- 2.担当者(sales)表に、以下のデータを作成する。
NULL;

-- 3.部門(dept)表から、部門番号(dno)が21以上の行データを、新部門(dept2)表に挿入する。
NULL;

-- 4.担当者(sales)表から、担当者番号(sno)が121以上の行データを、新担当者(sales2)表に挿入する。
NULL;

-- 5.新担当者(sales2)表に、以下のデータを挿入する。ただし、担当者名(sname)には現行のユーザ名を、配属日(edate)には現在の日付を挿入する。（SQL関数を使用すること）
NULL;

-- 6.新担当者(sales2)表に、以下のデータを挿入する。
NULL;

-- 7.新担当者(sales2)表で、担当者番号(sno)124の上司(mgr)を123に、売上金額(amt)を\325,000に変更する。
NULL;

-- 8.新部門(dept2)表で、すべての行の所在地(loc)をSAPPOROに変更すSELECT
NULL;

-- 9.新部門(dept2)表の部門番号(dno)が22であるデータの、所在地(loc)を、部門(dept)表の部門名(dname)がMENSのデータと同じ値に変更する。
NULL;

-- 10.新担当者(sales2)表の担当者名(sname)がMIYASHITAであるデータの、部門番号(dno)および上司(mgr)を、担当者(sales)表の担当者番号(sno)が105のデータと同じ値に変更する。
NULL;

-- 11.新担当者(sales2)表から、部門番号(dno)が22である担当者を削除する。
NULL;

-- 12.新担当者(sales2)表のすべての行を削除する。
NULL;

-- 13.新部門(dept2)表から、部門(dept)表の部門番号(dno)11の所在地(loc)と同じ部門データを削除する。
NULL;
